Repository: henyee/NBDYSJCT
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 众人闻言也就都转了话题，泰坦酒馆的生意的确是埃菲一个人撑起来的，不过要说这埃菲如何不检点，几年的街坊邻居，却也说不出这违心的话来。
en_us: Everyone changed the topic after hearing that. Eiffie had indeed supported Titan Tavern's business all by herself. However, the neighbors couldn't make themselves say that Eiffie was an indecent woman when they knew she wasn't.

source: 众人闻言你看我，我看你，顿觉无趣，就地解散。
en_us: All of them looked at one another after hearing that. They felt meaningless and dispersed.

source: 众人闻言只能纷纷止住脚步，不敢上前叨扰。
en_us: Upon hearing that, everyone stopped in their tracks, and did not dare to speak further.

source: 众员工闻言顿时像打了鸡血一般，纷纷拿出本子，盯着屏幕奋笔疾书。
en_us: The employees all took out their notebooks, and started staring at the screen and scribbling furiously upon hearing what their boss said.

source: 众大臣瑟瑟发抖，不敢多言。
en_us: The courtiers were all shaking with fear, afraid to speak.

source: 众大臣离去，只留下利尔一人。
en_us: All the courtiers left, and Lear was the only one who stayed.

source: 众大臣答应了一声，有几人匆匆离去。
en_us: "Yes!" all the courtiers answered, and a few of them quickly left.

source: 众大臣纷纷眼前一亮，还有好酒之人忍不住深吸了一口酒香。
en_us: All the courtiers' eyes lit up. Some of them who were alcohol lovers even took a deep sniff of it.

source: 众大臣躬身答应。
en_us: The courtiers bowed to accept the order.

source: 众大臣躬身道。
en_us: All the courtiers bowed, and said, "Your Majesty is wise."

source: 众奴隶精灵沉默了一会。
en_us: All the elven slaves were quiet for a moment.

source: 众守卫和在不远处外站着的兵士们都面色一变。
en_us: All the guards and the soldiers standing close by, went white too.

source: 众守卫答应了一声，提着刀剑棍棒冲上前来，毫不留情的往安东身上招呼。
en_us: The other guards rushed over with their weapons and started attacking Anton without reserves.

source: 众官员闻言皆是有点惊讶，今日卢西恩大人叫上他们几位兵部的同僚出来喝酒，近来接连发生大事，他们现在手上又没什么事情做，心情烦闷，自然欣然赴约。
en_us: The officials were surprised to hear that. Lord Lucien had invited his colleagues from the Ministry of Defense out for a drink today. Due to the big incidents that had happened recently, and how they had nothing on hand to do, they all felt stifled, so they all readily agreed to join Lucien.

source: 众护卫也是慌忙后撤，看着已经没了气息的布卢姆，脸色大变。
en_us: The guards all retreated quickly. When they saw the lifeless Blum, their expressions changed.

source: 众护卫围上前来，先用水把利尔身上的火焰浇灭，然后纷纷看向了利尔怀里抱着的将军。
en_us: The guards all came up, and put out the fire on Lear. After that, they all looked at the general that was in Lear's arms.

source: 众护卫面色一凛，不敢再多言。
en_us: The expressions of the guards all changed, and they did not dare to speak further.

source: 众精灵兵士的心灵防线瞬间崩溃，顿时化作鸟兽散去。
en_us: All the elven soldiers immediately broke down psychologically and dispersed.

source: 众精灵的眼中亮起了光芒，看着开阔的四野，没有铁荆棘围拢的天空，似乎一切都变得不同了。
en_us: A light glowed in the eyes of the elves. They looked at their vast surroundings. Everything seemed to look different without the iron fence.

source: 众精灵看着伊琳娜高呼，眼中满是狂热之色。
en_us: All the elves looked at Irina and cheered, with passion in their eyes.

source: 众精灵纷纷避开目光，低下了头。
en_us: All the elves avoided her gaze and looked down.

source: 众酋长纷纷点头答应。
en_us: All the chiefs nodded in agreement.

source: 众酋长虽对奥斯特用这等下作计谋对付一个小姑娘有些不齿，但还是满口奉承道。
en_us: Although all the tribal leaders despised Auster for using such a despicable plan on a little maiden, they still praised him.

source: 众骑士低头不敢言语。
en_us: All the knights lowered their heads, afraid to speak.

source: 优雅细致的葡萄果香和浓郁的陈酿木香，金色的澄澈酒液，无不彰显着这杯酒的等级。
en_us: The elegant and fine grape fragrance and and the rich aged wood aroma, and the clear golden liquid all showed the quality of this glass of wine.

source: 传送魔法失效，四人被留在了原地。
en_us: The teleportation failed and the four of them were left at where they were.

source: 伴着一声空气被抽爆的声音，厚重的冰墙瞬间化为漫天冰屑。
en_us: With the sound of the air being whipped, the thick ice wall disintegrated into ice shards instantly.

source: 伴着一声脆响，一道道裂纹出现在那魔法屏障之上，迅速蔓延而去，然后彻底崩碎。
en_us: With a crisp sound, cracks began to appear on the magical screen and spread out rapidly before the screen finally crumbled.

source: 伴着一声闷响，那条腿便被砸的直接弯折。
en_us: With a thud, that leg was immediately bent in an awkward angle.

source: 似乎是察觉到了麦格的异常，伊琳娜嘴角微微上扬，盈盈走进了房间，顺手关上门，啪嗒给反锁上。
en_us: As if she had sensed Mag's abnormality, Irina's lips curled up a little. She sashayed into the room and closed the door with click.

source: 但今晚不是杀肖恩的好时机。
en_us: However, tonight was not the best time to kill Sean.

source: 但从先前的影像来看，兰克斯特的确已经迷失了自我，成为了魔鬼的傀儡。
en_us: However, judging from the footage before, Rankster did lose himself and turn into the Devil's puppet.

source: 但他也提出了一个让她无法接受的条件，共享泰坦酒的窖藏和酿制方法。
en_us: However, he had also made a condition that she couldn't accept—sharing the aged Titan Liquor and the brewing methods.

source: 但他却在这里费时费力的冲击着酒窖，显然他的目标不止是钱，还有他们。
en_us: However, he was still wasting his time and energy crashing the cellar. Obviously, his target was not just money, it was them as well.

source: 但其已经不在这座城市内，暂时失去踪迹。
en_us: However, he was not currently in the city and had temporarily disappeared.

source: 但因为土块数量有限，所以目前只有两千三百余人脱离封印，数量稳定增加中，三年后可全部脱离封印。
en_us: However, due to the limited amount of soil, there were currently only about 2300 of them who had broken out of the seal. The numbers are increasingly steadily and in three years, all of them would be able to break out of the seal.

source: 但在冰层中埋藏了无数岁月，尸骨并没有想象中那么坚硬。
en_us: However, after being buried for eons in the ice, their bodies weren't as tough as one imagined.

source: 但埃菲并不这样认为，他知道茅台酒是怎样独特的存在，麦格又是怎样天才的酿酒师。
en_us: However, Eiffie didn't think so. She knew what kind of a unique existence the Maotai was and what a talented brewer Mag was.

source: 但她从那微笑中察觉到了森冷的杀气。
en_us: However, she had sensed a cold murderous intent from that smile.

source: 但她没有证据。
en_us: But she had no evidence.

source: 但如果将精神控制加入其中，便让飞剑有了更多的可能，也让他的战斗方式有了更多的可能。
en_us: However, if mind control was included in it, then there would give more possibilites to the flying sword and more possibilities to his fighting techniques.

source: 但对于艾米来说，却非常容易便看懂了。
en_us: However, it was something easy to understand for Amy.

source: 但抛去励志的伪装，这不是瞎胡闹吗？
en_us: However, throwing out the disguise of being inspirational, wasn't all this nonsense?

source: 但新住民对其进行了重新封印，并且在现场留下了一套切割工具和神秘传送装置，将切割之后的躯体送往它处，暂未确定去向。
en_us: However, the new inhabitants had resealed it and left a set of cutting tools and mysterious transporting set up there. The cut-up body was transported to somewhere else. Location unable to be confirmed currently.

source: 但火炮不一样，麦格对明代的红衣大炮进行了简单的改进，既拥有强大的杀伤力，又不会显得技术过于激进引起古老者的注意。
en_us: However, cannons were different. Mag had already modified the cannons from the 16th century. It would have a powerful lethality yet not so advanced that it would attract the Elder Things' attention.

source: 但缸裂了。
en_us: But it cracked.

source: 但过去的数十年当中，能够让他惊为天人的酒其实数量不多，马库斯的泰坦酒算一个，今天尝到的这款酒算第二个。
en_us: However, in the past few decades, there hadn't been many alcoholic drinks that could bowl him over. Marcus' Titan Liquor was one. This liquor that he tasted today could be considered as the second one.

source: 但这一刻他还是感受到了世界的恶意。
en_us: However, it could feel that evilness in this world at this moment

source: 但这一次，它却有点慌了？
en_us: However, this time, it was flustered?

source: 但这两日小姐换了供应商，在味道上有了更高的要求。
en_us: However, Eiffie had changed the supplier recently and had higher standards for the taste.

source: 但这样的存在，都是动不动就毁灭世界的，哪有空跑到各个农场去偷温度计和播种机啊。
en_us: However, such an existence that could destroy the world easily would never go to the various farms to steal thermometers and seeders.

source: 但这款神秘的酒又是从哪来的？
en_us: However, where did that mysterious liquor come from?

source: 但这老板也有些不厚道，三十只鹅全是训练过的，原本套圈的概率玩法，完全变成了套路，只进不出，那就有些过分了。
en_us: However, this boss was a little too much. All 30 geese were trained, so the probability of catching a goose was reduced to zero. That was too much.

source: 但除此之外的酒品，质量也不能拉胯太严重，宁缺毋滥，至少要配得上高端酒馆的定位，这也是筛选顾客非常重要的一步。
en_us: However, the other alcohols cannot be too low in quality. Quality over quantity. They must at least be of a certain standard and that is also the very important step to sieve out your customers.

source: 低沉的声音在冰窟中回荡。
en_us: A low voice echoed throughout the ice cavern.

source: 低矮的平房之外，却有着数米高的铁荆棘围栏，上面布满尖利而且剧毒的铁刺。
en_us: There were iron fences that were dozens of meters tall surrounding the short houses. They were also covered by sharp and poisonous iron spikes.

source: 佛跳墙自然是没空给他们做的，只能奖励他们两包方便面的样子。
en_us: He naturally would nto have time to make the 'Buddha Jumps Over the Wall' for them. It seemed like he could only reward them with two packs of instant noodles.

source: 作为一个优秀的地下工作者，麦格力求让自己的行为合理和自然。
en_us: As an excellent undercover, Mag would always strive to make his cover story natural and logical.

source: 作为一个兴趣使然的传教士，如果不当教士就要回家继承亿万家产的他，还是喜欢自由自在的生活，混乱之城就挺好的，想家的时候可以回家看看，平时就离得远一点，清闲自在，逍遥又快乐。
en_us: As a missionary who was pursuing his interest, and had to inherit hundreds of millions of fortune if he quit being a missionary, he still preferred a carefree lifestyle. Chaos City was good. He could go home if he missed home, but he could keep a good distance normally. He was carefree and happy.

source: 作为一个初出茅庐的系统，竟然被宿主在自己身上完成了新手任务……
en_us: As a new system, it actually let its host complete the novice assignment on it…

source: 作为一个厨师，最大的成就感莫过于自己努力做出来的食物，获得了别人的高度认可。
en_us: As a chef, his greatest satisfaction was receiving others' acknowledgement for the food that he had painstakingly cooked.

source: 作为一个厨师，麦格很享受来自客人的赞誉。
en_us: As a chef, Mag enjoyed the praises from hsi customers.

source: 作为一个受过专业训练的观察者，这是不应该出现的情绪。
en_us: As a formally trained Observer, this was an emotion that she shouldn't have.

source: 作为一个官场老油条，察言观色的基本能力还是有的，他看得出亚伯罕此时的心情并不好。
en_us: As someone with a lot of experience in the political scene, being aware of the situation was basic. Aulden could tell that Abraham was in a bad mood right now.

source: 作为一个有职业操守的酒馆老板，为了给客人带来专业的服务，他的原则是上班时间不能喝酒。
en_us: As a tavern owner with professional ethics, in order to give his clients the best service, his principle was always not to drink during work hours.

source: 作为一个有钱有才有实力的男人，竟然连工作都要将就，这太不符合他的性格了。
en_us: As a man who was rich, talented and had power, and yet he had to make do with his job. This didn't match his character.

source: 作为一个极度自律的人，吃的过饱已经很多年没有在她身上发生，没想到在一家人类的酒馆里吃撑了。
en_us: As an extremely self disciplined person, she hadn't burp from overeating for a long time. She didn't expect to overeat at a human's tavern.

source: 作为一个父亲，他实在无法坐视艾米生吃蜗牛的这种行为。
en_us: As a father, he really couldn't stand by and watch Amy eat a snail alive.

source: 作为一个系统。
en_us: As a system, it would be an utter disgrace if other systems were to find out that its host gained experience points from it.

source: 作为一个系统，他没想到自己竟然一出场就被宿主嫌弃了。
en_us: As a system, it did not expect to be despised by its owner the moment it appeared.

source: 作为一个系统，竟然被宿主撸羊毛，真是系统之耻！
en_us: As a system, being threatened by its host was an embarrassment to all systems!

source: 作为一个继承家业，掌管了十几年泰坦酒馆的女人，虽然不能亲手酿出什么佳酿，但对酒还是颇为了解的，隔着这般距离，还能散发出如此酒香的美酒，她闻所未闻。
en_us: As a woman who inherited her family business and operated the Titan Tavern for 10 over years, although she couldn't brew any excellent liquors herself, she had a great understanding of liquors. She had never seen liquor that could give out such an aroma at such a distance.

source: 作为一个被吐槽了半辈子做饭难吃的女人，从未想过自己有一天能够靠着做菜让丈夫和子女们赞不绝口。
en_us: As a woman who had been dissed as a lousy cook for half her life, she had never thought that one day, she would earn praises from her husband and children with her cooking.

source: 作为一个踏入半神之境的男人，一夜没睡根本感受不到疲惫。
en_us: As a man who had stepped into the demigod realm, he wasn't tired even when he didn't rest for the whole night.

source: 作为一个铁血硬汉，麦格突然有点受伤……
en_us: As a tough man, Mag suddenly felt a little hurt…

source: 作为一名合格的销售，费奇非常清楚一条商业街的人气聚集原理。
en_us: As a proper sales person, Fitch knew very well the rational behind a street's popularity.

source: 作为一名真正的爱酒人士，无论是当年成立美酒协会，还是组织发起品酒大会，都是想要发掘出更多的美酒和更好的酿酒师。
en_us: As a real alcoholic beverage aficionado, be it setting up the Wine and Liquor Association back then, or organizing the liquor tasting event, Kurt's intention was to discover more great alcoholic beverages and brewers.

source: 作为一名观察者，她有职责对诺兰大陆上一切未知的事物进行探究，包括食物。
en_us: As an Observer, she had a duty to investigate all unknown stuff on the Norland Continent, including food.

source: 作为一名酸辣拍黄瓜的爱好者，麦格早已在心里拟定了一份料汁的配方：生抽+陈醋+少许白糖+耗油+蒜蓉+辣子红油+朝天椒。
en_us: As a lover of sour and spicy Smashed Cucumber Salad, Mag had already drafted a recipe for the flavoring sauce in his mind: soy sauce, vinegar, a little sugar, oyster sauce, garlic, red oil and Chaotian Pepper.

source: 作为伊琳娜的心腹大将，艾许莉是少数几位知晓他身份的人。
en_us: As Irina's closed aide, Ashley was one of the few people who knew his identity.

source: 作为帝国的元帅，三军统帅，他必须要清楚的告知陛下现在帝国面对的是怎样的困境和敌人。
en_us: As the marshal of the empire, the commander of the three military forces, he had to clearly tell His Majesty what kind of situation and enemy the empire was facing.

source: 作为教廷德高望重的大主教，希利对于口腹之欲早已淡化，清心寡欲的生活已经成为习惯，可在面前这一桌菜前，却是忍不住咽了咽口水。
en_us: As a highly respected archbishop of the Holy See, Seely didn't have much desire for delicious food. He was already used to a simple life, but he still couldn't help gulping when he faced the dishes.

source: 作为条件，和平联盟各族要派出一支规模庞大的联军，与洛斯帝国一道阻击魔鬼和亡灵军团南下。
en_us: As the condition, every race in the Peace Alliance had to deploy a large army to stop the devil and its Army of the Dead from coming southwards together with the Roth Empire.

source: 作为罗莫街的第一包租公，手握一百多栋楼的他，已经拥有这个权利。
en_us: As the first landlord of Romo Street, Mag who had a few hundred buildings to hsi name had that power.

source: 你只管大力吸，剩下的交给奇迹。
en_us: All you had to do is suck hard and leave the rest to miracles.

source: 你可是一个酒馆老板啊。
en_us: You are the boss of a tavern.

source: 你听听，这还是人话吗。
en_us: Just listen to that. Did that even sound like what a human would say?

source: 你看，洛都人民就是这么实诚。
en_us: See, the people of Rodu are simply so honest.

source: 你看，这种天生变态，就是那么无敌。
en_us: See, such a natural pervert was just that invincible.

source: 你这个人不对劲！
en_us: There's something very wrong with you!

source: 依旧是这个酒窖，当年她被父亲拼尽全力放入地窖中，然后用身体挡在地窖前。
en_us: It was still this cellar. Her father pushed her into this cellar with all his might and then blocked the cellar with his body.

source: 倒不是他更勤奋了，他只是担心艾米的破系统又给她发布一个什么爱心早餐任务。
en_us: It was not because he was excited, but worried that Amy's darn System would give her anothr breakfast making mission.

source: 倒不是威士忌不好，只是他觉得风头出一次就够了，给同行留点面子。
en_us: It wasn't that the whiskey wasn't good enough. It was because he felt that it was enough to show off once and he should save some pride for his colleagues.

source: 倒是当年乔修开始谋划暗杀亚历克斯，斩去肖恩一臂的谋划，让他有些意外。
en_us: But Alex's assassination and Sean's arm being chopped off as well as Josh's plan did shock Andre.

source: 倘若今日不是利尔在此守护，恐怕大将军府也要被烧成一片白地。
en_us: If it were not because of Lear today, the great general's mansion would probably have been burnt to ashes.

source: 倘若杀死布卢姆将军之事为乔修所为，那之前几位兵部大臣被灭门的惨案，恐怕也与他脱不了干系。
en_us: If Josh was the one who killed General Blum, he would most probably be the one responsible for the murders at the several other generals' homes previously.

source: 偶有怀旧的客人过来转转，可看着凋零的长街，难得一寻的餐厅和酒馆，却也没了多少进店消费的冲动。
en_us: Some customers who were nostalgic would come over to take a look. However, looking at the deserted street and the few opened restaurants and taverns, there wasn't much urge to go in and spend in their hearts.

source: 像他前世那么飘的，容易招人嫉妒。
en_us: A proud person as he was in his previous life would often incite jealousy from others.

source: 像埃菲这样的女人，多半拿的是宫斗娘娘的剧本。
en_us: A woman like Eiffie probably took the harem politics script of an imperial concubine in the palace.

source: 充能完毕的箭首巨炮再次向着克苏鲁发射了一枚电磁炮，同时投下了数枚集束炸弹，借着电磁炮的反冲力，瞬间拉开了与克苏鲁的距离，撕裂虚空，离开了这里。
en_us: The electromagnetic gun at the front of the ship that had finished recharging, fired another shot. At the same time, a few cluster bombs were dropped. With the electromagnetic gun's recoil, they got away from Cthulhu. A rip was created in the void and they left.

source: 先前他们在冰原之上遭遇克苏鲁，身陷绝境，几乎要被吞噬的时候，他突然被攻击陷入晕厥，然后就什么都不记得了。
en_us: They had met Cthulhu on the snow plain earlier and were in a dire situation. He was suddenly attacked and knocked out just as he was about to be swallowed.

source: 先前他们有多嚣张，现在就有多狼狈，这个反转，令人喜欢。
en_us: Their arrogance just now had rendered them so pathetic. This turn of events was rather satisfying.

source: 先前如果不是晞出现，克苏鲁的触手应该已经洞穿她的心脏。
en_us: If Xi hadn't appeared earlier, Cthulhu's tentacle would have peirced her heart.

source: 先前皇宫附近出现了强烈的战斗波动，除了留守皇宫的强者，他们三个是最先赶到并拦住行凶者的。
en_us: Intense battle fluctuations were detected near the royal palace. Other than the powerhouses who had stayed back to guard the palace, the three of them were the first to arrive and intercepted the perperator.

source: 先前那中年工作人员听到安奈林的话，看麦格的目光也是有些变了。
en_us: That middle-aged staff member looked at Mag differently after she heard Aneurin's words.

source: 先前那点幽怨早已随着美酒下肚烟消云散，这会他只后悔怎么没有早点遇上这家酒馆。
en_us: His displeasure had completely disappeared, just like the wine that went down his throat. The only regret he had was not discovering this tavern earlier.

source: 先尝一口汤。
en_us: Tasting the soup first.

source: 先是泰坦酒，接着是茅台酒，两款神酒先后出世，将这场品酒大会推上高潮，也注定让其他酒成为了配角。
en_us: It was first Titan Liquor and then followed by Maotai Liquor. The appearance of these two legendary liquors had pushed this liquor tasting event to its climax and rendered all the other liquors into mere supporting roles.

source: 光是给鸡糊上一层泥壳，估计就会造成许多翻车现场。
en_us: Just to apply the mud casing on the chicken would cause many of them to flop.

source: 克拉苏和尤利安都是彻头彻脑的疯子，区别在于克拉苏之前有着法师塔的身份会有所收敛，而尤利安素来随性，想要用教廷来镇住他们完全没有可能。
en_us: Krassu and Urien were complete lunatics. The only difference between the two was that Krassu restrained himself a little because of his status at the Magus Tower, while Urien always did as he pleased. It was completely impossible to use the Holy See to subdue them.

source: 克苏鲁冲着巨舰发出了一串无法听懂的怒吼，发动古尸对巨舰和麦格他们再次发起攻击。
en_us: Cthulhu let out an indecipherable roar at Cthulhu. It made the ancient corpses launch another attack on the starship and Mag.

source: 克苏鲁发出了一声令人作呕的声音，然后向着麦格的方向蠕动而去，一路之上，冰川碎裂。
en_us: Cthulhu let out a sickening sound before wiggling towards Mag. Ice shattered along his path.

source: 克苏鲁发出了一声如破碎玻璃摩擦的声音，体外突然涌出无数黑色魔气，倒卷而出，将那包裹着他地圣光尽数熄灭。
en_us: Cthulhu made a sound that seemed like shattered glass rubbing against each other. Countless black evil aura gushed out and eliminated all the Holy Light that engulfed him.

source: 克苏鲁庞大的身躯缓缓停下，然后转身对着伊琳娜。
en_us: Cthulhu's gigantic body slowed down gradually and then turned to face Irina.

source: 克苏鲁的强大毋庸置疑，在混乱之城外封印中，数十位十级强者联手也几乎奈何不了它。
en_us: Cthulhu's power was undoubtable. Dozens of 10th-tier powerhouses couldn't do anything to it while it was in the seal outside of Chaos City.

source: 克苏鲁的躯体上发现了强大的雷电印记，超出新住民的实力上限，诺兰大陆疑似出现限制级强者。
en_us: Very strong lightning traces found in Cthulhu's body. This power exceeds the upper limit of the new inhabitants. It is suspected that an off-limit powerhouse had appeared on the Norland Continent.

source: 克苏鲁的速度比他更快，他没有办法在触手刺中伊琳娜前将它斩断。
en_us: Cthulhu's speed was faster than his. He had no way to slash that tentacle off before it reached Irina.

source: 八目相对，气氛有点尴尬。
en_us: The four pairs of eyes met, and the atmosphere was awkward.

source: 六位十级强者跟在他们身后，颇为警惕的提防着两人。
en_us: Six 10th-tier powerhouses followed closely behind them, constantly wary of the two of them.

source: 六十组参赛酒全部评选完毕，分数也已经全部给出。
en_us: After reviewing all 60 groups, all the scores were given.

source: 兰克斯特也是被一剑劈飞，长枪刺地，后退十数米后停下。
en_us: Rankster was also sent flying with a single blow. The spear was pierced into the ground and he came to a stop after tens of meters.

source: 兰克斯特前冲的动作一滞，脸上出现了挣扎之色，眼睛也在蓝色与红色之间切换。
en_us: Rankster paused in his action to dash forward. There was a sign of struggle on his face and his eyes started to change between blue and red.

source: 兰克斯特沉默不语。
en_us: Rankster was silent.

source: 兰克斯特点头，转身离开冰窟。
en_us: Rankster nodded and left the ice cavern.

source: 兰克斯特的目光瞬间收回，长枪回缩，扫向飞来的天都剑。
en_us: Rankster looked away. He retracted his spear and aimed it towards the Tian Du sword which was flying towards him.

source: 兰克斯特盯上了紫纹狮鹫，手中长枪扬起，瞄准了阿紫。
en_us: Rankster fixed his gaze on the purple-striped griffin. He riased the spear in his hand and aimed at Ah Zi.

source: 兰克斯特眼中的挣扎已经消失，取而代之的是一片猩红，而且实力似乎还得到了加强，疯狂的对麦格发起攻击。
en_us: The struggle in Rankster's eyes was gone and a patch of red replaced it. Furthermore, his power seemed to be enhanced as he attacked Mag crazily.

source: 兰克斯特瞬间来到他的面前，短兵相接。
en_us: Rankster appeared in front of him immediately and launched his attack.

source: 兰克斯特红色的眼睛似乎微微闪动了一下，不过很快陷入了更加疯狂的躁动中，对麦格发起了更为强烈的进攻。
en_us: The red in Rankster's eyes seemed to flicker a little. However, Rankster quickly fell int a deeper fury and attacked Mag even harder.

source: 兰贝街的确很热闹，不过也因为太过热闹而被麦格给排除了，相反这条位于兰贝街背后的罗莫街，要清静许多，而且店铺选择更多，让麦格挺满意。
en_us: Lambay Street was indeed very boisterous, but it was also eliminated by Mag because it was too boisterous. In contrast, Romo Street behind Lambay Street was much quieter, and there were more shop choices. Mag was satisfied with it.

source: 关于洛都城内的核动力事件，也有了最新进展，那是一台核动力印刷机引发的，此物为麦格·亚历克斯从一处地窟之中挖掘出来的。
en_us: There is also a new development on the Rodu's nuclear incident. It was caused by a nuclear-powered printing machine. This item was dug by Mag Alex from an underground cavern.

source: 兵部大院里的人都知道，赫克托和波比是至交，平日时常一同喝酒。
en_us: Everyone in the Ministry of Defense knew that Hector and Bobby were great friends, and they often drank together.

source: 兵部衙门门口，一位身材高大的将领看着数位骑士沉声道：“找到了吗？”
en_us: At the entrance of the military, a big and tall general looked at the knights in front of him, and asked, "Have you found them?"

source: 兵部被围了整整三天，许多官员被带走问话，连他这种完全闲职的人也被带走问了话，今天才准许他回到兵部继续工作。
en_us: The military had been cordoned off for three whole days. Many officials were brought away to be questioned, and even those with idle roles like him were not spared. He was only allowed to go back to the military to continue working today.

source: 其中一个黑袍人接住令牌查看了一番，点点头，将令牌递还，让开路，示意麦格可以通过。
en_us: One of the man in black robe checked the tablet and nodded. He returned the tablet and stepped aside, indicating that Mag could pass.

source: 其中关于亚伯罕公爵和温妮莎公主是这家酒馆的常客，酒馆老板身份颇为神秘的消息，也是不胫而走。
en_us: Among them was news that Duke Abraham and Princess Vanessa were regulars of this tavern. The identity of the tavern owner was rather mysterious.

source: 其中大多数是获得过金奖的酒，但按照品酒大会的规则，如果往届的金奖酒没有出现明显的改进和优化，是需要额外减去3分的。
en_us: Most of them were liquors that had gotten the gold award before, but according the liquor tasting event's rules, extra three points would be taken off if the previous gold award winner didn't have any obvious improvements.

source: 其他三位评委也是拿起了号牌，都给出了10分的满分评分。
en_us: The other three judges also raised their signs, giving the full marks of 10 points.

source: 其他三位评委也是给出了10分的最高评分。
en_us: The other three judges also gave the highest score of 10 points.

source: 其他两盘是凉拌猪耳朵和凉拌猪舌头，只是听菜名，他便觉得没有食欲，甚至隐约觉得有点恶心。
en_us: The other two plates were the pig ears salad and pig tongue salad. The names of the side dishes alone made Lucien lose his appetite. He even found them disgusting.

source: 其他人也知道奥尔登现在肯定坐不住，可他们不能走啊，这要是走了，不是明摆着对亚伯罕不满吗。
en_us: The rest also knew that Aulden would not be able to stay behind, but they could not leave. If they left, it would be akin to saying that they were unhappy with Abraham.

source: 其他人对于面前已经满上的茅台酒表现出了更大的兴趣。
en_us: The others seemed more interested in Maotai before them.

source: 其他四个黑袍人也是握住了腰间别着的武器，慢慢围上前来。
en_us: The other four black-robed men grasped the weapons at their waists and slowly gathered around Mag.

source: 其他地区的期刊销量加起来，只有洛斯帝国的五分之一左右。
en_us: The sales of other regions added up would only make up one-fifth of the Roth Empire's sales.

source: 其他客人也是跟着抱怨了几声。
en_us: The other customers also grumbled.
